### Pandas:
        - pandas is a builtin library using for data analysis. by using this library we can do data manipulation,data visualization,building machine learning models.

    - pandas implements a no of powerful data operations familier to users of both database frame works and spredsheet programs.
    
    - pandas contains two different datastructures:
                - Pandas Series
                - pandas DataFrame
                
                
### Library installation
    - pip install package name
        - pip install pandas

In [2]:
pip install pandas

Requirement already satisfied: pandas in c:\users\aditya\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\aditya\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\aditya\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\aditya\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\aditya\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\aditya\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [4]:
import pandas as pd

In [5]:
pd.__version__

'2.0.3'

#### Pandas Series:
        - A Series is similar to a 1-d array,it contains values of the same type(integer,char....)
        - syntax:
                pd.Series([list of elements])
        - Pandas Series:
                - list
                - tuple
                - dictionary
                - numpy
                - date_range

In [ ]:
### How to create pandas series by using list

In [6]:
li=[12,34,56,67,78,89]
s1=pd.Series(li)
s1

0    12
1    34
2    56
3    67
4    78
5    89
dtype: int64

In [7]:
s1[0]

12

In [10]:
print(s1[:])
print(s1[::-1])

0    12
1    34
2    56
3    67
4    78
5    89
dtype: int64
5    89
4    78
3    67
2    56
1    34
0    12
dtype: int64

In [ ]:
#### How to create pandas series by using tuple

In [11]:
t=(12,34,56,67,78,89)
s2=pd.Series(t)
s2

0    12
1    34
2    56
3    67
4    78
5    89
dtype: int64

In [ ]:
##### How to create pandas by using dict

In [12]:
d={'name':'srikanya','rollnumber':78989,'section':'A','branch':'CSE'}
s3=pd.Series(d)
s3

name          srikanya
rollnumber       78989
section              A
branch             CSE
dtype: object

#### How to change index in pandas:
        - pd.index()

In [13]:
s3.index=['a','b','c','d']
s3

a    srikanya
b       78989
c           A
d         CSE
dtype: object

In [14]:
import numpy as np

In [16]:
n=np.arange(1,11)
s4=pd.Series(n)
s4

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int32

##### data_range()
        - syntax:
                pd.date_range(startrange,end range)

In [17]:
dates=pd.date_range(start='2023-11-01',end='2023-11-30')
dates

DatetimeIndex(['2023-11-01', '2023-11-02', '2023-11-03', '2023-11-04',
               '2023-11-05', '2023-11-06', '2023-11-07', '2023-11-08',
               '2023-11-09', '2023-11-10', '2023-11-11', '2023-11-12',
               '2023-11-13', '2023-11-14', '2023-11-15', '2023-11-16',
               '2023-11-17', '2023-11-18', '2023-11-19', '2023-11-20',
               '2023-11-21', '2023-11-22', '2023-11-23', '2023-11-24',
               '2023-11-25', '2023-11-26', '2023-11-27', '2023-11-28',
               '2023-11-29', '2023-11-30'],
              dtype='datetime64[ns]', freq='D')

#### pands DataFrame:
        - A Data Frame is simply a table where each column is a pandas series
        - syntax:
                pd.DataFrame(list of elements)

In [ ]:
### creating DataFrame

In [19]:
li1=[23,12,35,16,78,90]
print(li1)

[23, 12, 35, 16, 78, 90]

In [20]:
df=pd.DataFrame(li1)
df

    0
0  23
1  12
2  35
3  16
4  78
5  90

In [21]:
li2=[[12,34,45],[23,45,56],[89,90,87]]
df1=pd.DataFrame(li2)
df1

    0   1   2
0  12  34  45
1  23  45  56
2  89  90  87

In [22]:
df1.index=['a','b','c']

In [23]:
df1

    0   1   2
a  12  34  45
b  23  45  56
c  89  90  87

In [24]:
df1.columns=['x','y','z']

In [25]:
df1

    x   y   z
a  12  34  45
b  23  45  56
c  89  90  87

In [ ]:
#### How to create DataFrame by using pandas series

In [30]:
df2=pd.DataFrame(pd.Series([12,45,67,89,90],index=['a','b','c','d','e']))
df2

    0
a  12
b  45
c  67
d  89
e  90

In [ ]:
#### creating dataframe with dict

In [39]:
d1={'i':pd.Series([12,23,34,45,56,67],index=[1,2,3,4,5,6]),
    'j':pd.Series([12,34,56],index=[2,4,6]),
    'k':pd.Series([56,67,12],index=[1,3,5])}
df3=pd.DataFrame(d1)
df3

    i     j     k
1  12   NaN  56.0
2  23  12.0   NaN
3  34   NaN  67.0
4  45  34.0   NaN
5  56   NaN  12.0
6  67  56.0   NaN

#### How to use DataSet In Pandas:
    - kaggle.com
            - Birds' Bones and Living Habits

#### Data analysis with pandas Data Sets:
        - datset reading
        - datset indexing
        - dataset filtering
        - dataset sorting
        - statistical Operations on Dataset
        - Data set Cleaning
        - dataset plotting
        - dataset saving

In [40]:
print(dir(pd))

['ArrowDtype', 'BooleanDtype', 'Categorical', 'CategoricalDtype', 'CategoricalIndex', 'DataFrame', 'DateOffset', 'DatetimeIndex', 'DatetimeTZDtype', 'ExcelFile', 'ExcelWriter', 'Flags', 'Float32Dtype', 'Float64Dtype', 'Grouper', 'HDFStore', 'Index', 'IndexSlice', 'Int16Dtype', 'Int32Dtype', 'Int64Dtype', 'Int8Dtype', 'Interval', 'IntervalDtype', 'IntervalIndex', 'MultiIndex', 'NA', 'NaT', 'NamedAgg', 'Period', 'PeriodDtype', 'PeriodIndex', 'RangeIndex', 'Series', 'SparseDtype', 'StringDtype', 'Timedelta', 'TimedeltaIndex', 'Timestamp', 'UInt16Dtype', 'UInt32Dtype', 'UInt64Dtype', 'UInt8Dtype', '__all__', '__builtins__', '__cached__', '__doc__', '__docformat__', '__file__', '__git_version__', '__loader__', '__name__', '__package__', '__path__', '__spec__', '__version__', '_config', '_is_numpy_dev', '_libs', '_testing', '_typing', '_version', 'annotations', 'api', 'array', 'arrays', 'bdate_range', 'compat', 'concat', 'core', 'crosstab', 'cut', 'date_range', 'describe_option', 'errors', 'eval', 'factorize', 'from_dummies', 'get_dummies', 'get_option', 'infer_freq', 'interval_range', 'io', 'isna', 'isnull', 'json_normalize', 'lreshape', 'melt', 'merge', 'merge_asof', 'merge_ordered', 'notna', 'notnull', 'offsets', 'option_context', 'options', 'pandas', 'period_range', 'pivot', 'pivot_table', 'plotting', 'qcut', 'read_clipboard', 'read_csv', 'read_excel', 'read_feather', 'read_fwf', 'read_gbq', 'read_hdf', 'read_html', 'read_json', 'read_orc', 'read_parquet', 'read_pickle', 'read_sas', 'read_spss', 'read_sql', 'read_sql_query', 'read_sql_table', 'read_stata', 'read_table', 'read_xml', 'reset_option', 'set_eng_float_format', 'set_option', 'show_versions', 'test', 'testing', 'timedelta_range', 'to_datetime', 'to_numeric', 'to_pickle', 'to_timedelta', 'tseries', 'unique', 'util', 'value_counts', 'wide_to_long']

In [ ]:
#### DataSet reading:
        - pd.read_csv('filename.csv')
        - pd.read_excel('filename.xlsx')

In [41]:
data=pd.read_csv('bird.csv')
data

,id,huml,humw,ulnal,ulnaw,feml,femw,tibl,tibw,tarl,tarw,type
0,0,80.78,6.68,72.01,4.88,41.81,3.70,5.50,4.03,38.70,3.84,SW
1,1,88.91,6.63,80.53,5.59,47.04,4.30,80.22,4.51,41.50,4.01,SW
2,2,79.97,6.37,69.26,5.28,43.07,3.90,75.35,4.04,38.31,3.34,SW
3,3,77.65,5.70,65.76,4.77,40.04,3.52,69.17,3.40,35.78,3.41,SW
4,4,62.80,4.84,52.09,3.73,33.95,2.72,56.27,2.96,31.88,3.13,SW
...,...,...,...,...,...,...,...,...,...,...,...,...
415,415,17.96,1.63,19.25,1.33,18.36,1.54,31.25,1.33,21.99,1.15,SO
416,416,19.21,1.64,20.76,1.49,19.24,1.45,33.21,1.28,23.60,1.15,SO
417,417,18.79,1.63,19.83,1.53,20.96,1.43,34.45,1.41,22.86,1.21,SO
418,418,20.38,1.78,22.53,1.50,21.35,1.48,36.09,1.53,25.98,1.24,SO
419,419,17.89,1.44,19.26,1.10,17.62,1.34,29.81,1.24,21.69,1.05,SO